Repository: abdulazeez761/Quranic_School
Catalog: src/Hafiz.Web/Resources/Areas/Parent/Views/Children/Details.*.resx
Languages: ar

source: Child Details
ar: تفاصيل الطالب

# NoClass
source: Not enrolled in class
ar: غير مسجل في حلقة

source: Back to List
ar: العودة للقائمة

source: Total Attendance
ar: إجمالي الحضور

source: Completed Wirds
ar: الأوراد المكتملة

source: Memorized Juz
ar: الأجزاء المحفوظة

source: Tajwid Level
ar: مستوى التجويد

# TajwidLevel_Beginner
source: Beginner
ar: تمهيدي/مبتدئ

# TajwidLevel_Intermediate
source: Intermediate
ar: متوسط

# TajwidLevel_Advanced
source: Advanced
ar: متقدم

# TajwidLevel_none
source: None
ar: غير محدد

# TajwidLevel_First
source: Beginner
ar: تمهيدي/مبتدئ

# TajwidLevel_Second
source: Intermediate
ar: متوسط

# TajwidLevel_Third
source: Advanced
ar: متقدم

source: Personal Information
ar: المعلومات الشخصية

source: Email
ar: البريد الإلكتروني

source: Phone Number
ar: رقم الهاتف

source: Date of Birth
ar: تاريخ الميلاد

source: Gender
ar: الجنس

# Gender_Male
source: Male
ar: ذكر

# Gender_Female
source: Female
ar: أنثى

# Gender_male
source: Male
ar: ذكر

# Gender_female
source: Female
ar: أنثى

source: Attendance History
ar: سجل الحضور

source: Date
ar: التاريخ

source: Class
ar: الحلقة

source: Status
ar: الحالة

# AttendanceStatus_Present
source: Present
ar: حاضر

# AttendanceStatus_Late
source: Late
ar: متأخر

# AttendanceStatus_Absent
source: Absent
ar: غائب

# AttendanceStatus_Excused
source: Excused
ar: معذور

# AttendanceStatus_Pending
source: Pending
ar: قيد الانتظار

# NoAttendanceRecords
source: No attendance records found
ar: لا توجد سجلات حضور

source: Wird Assignments
ar: الأوراد اليومية

# AssignmentType_Wird
source: Wird
ar: ورد

# AssignmentType_Memorization
source: Memorization
ar: حفظ

# AssignmentType_Revision
source: Revision
ar: مراجعة

# AssignmentType_Tajwid
source: Tajwid
ar: تجويد

# AssignmentType_Tafsir
source: Tafsir
ar: تفسير

# AssignmentType_Other
source: Other
ar: أخرى

# AssignmentType_newMemorization
source: New Memorization
ar: حفظ جديد

# AssignmentType_review
source: Review
ar: مراجعة

# AssignmentType_Recitation
source: Recitation
ar: تلاوة

source: From
ar: من

source: To
ar: إلى

source: Page
ar: صفحة

# AssignmentStatus_notSet
source: Not Set
ar: غير محدد

# AssignmentStatus_poor
source: Poor
ar: ضعيف

# AssignmentStatus_fair
source: Fair
ar: مقبول

# AssignmentStatus_good
source: Good
ar: جيد

# AssignmentStatus_veryGood
source: Very Good
ar: جيد جداً

# AssignmentStatus_excellent
source: Excellent
ar: ممتاز

source: Completed
ar: مكتمل

# NoWirdAssignments
source: No wird assignments found
ar: لا توجد أوراد مسجلة

source: Online Meetings
ar: الاجتماعات الإلكترونية

source: Class Meeting In Progress
ar: اجتماع الحلقة قائم

# HasActiveMeeting
source: has an active meeting
ar: لديه اجتماع نشط

source: Join Meeting
ar: الانضمام للاجتماع

source: No Active Meeting
ar: لا يوجد اجتماع نشط

# NoActiveMeetingDescription
source: There are currently no active meetings for this class
ar: لا توجد اجتماعات نشطة حالياً لهذه الحلقة

source: Parent Notes
ar: ملاحظات ولي الأمر

# NoParentNotes
source: No notes available
ar: لا توجد ملاحظات متاحة

source: Note by
ar: ملاحظة من

source: Overview
ar: نظرة عامة

source: Meetings
ar: الاجتماعات

source: Notes
ar: الملاحظات

# Surah_AlFatiha
source: Al-Fatiha
ar: الفاتحة

# Surah_AlBaqarah
source: Al-Baqarah
ar: البقرة

# Surah_AliImran
source: Ali 'Imran
ar: آل عمران

# Surah_AnNisa
source: An-Nisa
ar: النساء

# Surah_AlMaidah
source: Al-Ma'idah
ar: المائدة

# Surah_AlAnam
source: Al-An'am
ar: الأنعام

# Surah_AlAraf
source: Al-A'raf
ar: الأعراف

# Surah_AlAnfal
source: Al-Anfal
ar: الأنفال

# Surah_AtTawbah
source: At-Tawbah
ar: التوبة

# Surah_Yunus
source: Yunus
ar: يونس

# Surah_Hud
source: Hud
ar: هود

# Surah_Yusuf
source: Yusuf
ar: يوسف

# Surah_ArRad
source: Ar-Ra'd
ar: الرعد

# Surah_Ibrahim
source: Ibrahim
ar: إبراهيم

# Surah_AlHijr
source: Al-Hijr
ar: الحجر

# Surah_AnNahl
source: An-Nahl
ar: النحل

# Surah_AlIsra
source: Al-Isra
ar: الإسراء

# Surah_AlKahf
source: Al-Kahf
ar: الكهف

# Surah_Maryam
source: Maryam
ar: مريم

# Surah_TaHa
source: Ta-Ha
ar: طه

# Surah_AlAnbiya
source: Al-Anbiya
ar: الأنبياء

# Surah_AlHajj
source: Al-Hajj
ar: الحج

# Surah_AlMuminun
source: Al-Mu'minun
ar: المؤمنون

# Surah_AnNur
source: An-Nur
ar: النور

# Surah_AlFurqan
source: Al-Furqan
ar: الفرقان

# Surah_AshShuara
source: Ash-Shu'ara
ar: الشعراء

# Surah_AnNaml
source: An-Naml
ar: النمل

# Surah_AlQasas
source: Al-Qasas
ar: القصص

# Surah_AlAnkabut
source: Al-'Ankabut
ar: العنكبوت

# Surah_ArRum
source: Ar-Rum
ar: الروم

# Surah_Luqman
source: Luqman
ar: لقمان

# Surah_AsSajda
source: As-Sajda
ar: السجدة

# Surah_AlAhzab
source: Al-Ahzab
ar: الأحزاب

# Surah_Saba
source: Saba
ar: سبأ

# Surah_Fatir
source: Fatir
ar: فاطر

# Surah_YaSin
source: Ya-Sin
ar: يس

# Surah_AsSaffat
source: As-Saffat
ar: الصافات

# Surah_Sad
source: Sad
ar: ص

# Surah_AzZumar
source: Az-Zumar
ar: الزمر

# Surah_Ghafir
source: Ghafir
ar: غافر

# Surah_Fussilat
source: Fussilat
ar: فصلت

# Surah_AshShura
source: Ash-Shura
ar: الشورى

# Surah_AzZukhruf
source: Az-Zukhruf
ar: الزخرف

# Surah_AdDukhan
source: Ad-Dukhan
ar: الدخان

# Surah_AlJathiya
source: Al-Jathiya
ar: الجاثية

# Surah_AlAhqaf
source: Al-Ahqaf
ar: الأحقاف

# Surah_Muhammad
source: Muhammad
ar: محمد

# Surah_AlFath
source: Al-Fath
ar: الفتح

# Surah_AlHujurat
source: Al-Hujurat
ar: الحجرات

# Surah_Qaf
source: Qaf
ar: ق

# Surah_AdhDhariyat
source: Adh-Dhariyat
ar: الذاريات

# Surah_AtTur
source: At-Tur
ar: الطور

# Surah_AnNajm
source: An-Najm
ar: النجم

# Surah_AlQamar
source: Al-Qamar
ar: القمر

# Surah_ArRahman
source: Ar-Rahman
ar: الرحمن

# Surah_AlWaqia
source: Al-Waqi'a
ar: الواقعة

# Surah_AlHadid
source: Al-Hadid
ar: الحديد

# Surah_AlMujadila
source: Al-Mujadila
ar: المجادلة

# Surah_AlHashr
source: Al-Hashr
ar: الحشر

# Surah_AlMumtahina
source: Al-Mumtahina
ar: الممتحنة

# Surah_AsSaff
source: As-Saff
ar: الصف

# Surah_AlJumua
source: Al-Jumu'a
ar: الجمعة

# Surah_AlMunafiqun
source: Al-Munafiqun
ar: المنافقون

# Surah_AtTaghabun
source: At-Taghabun
ar: التغابن

# Surah_AtTalaq
source: At-Talaq
ar: الطلاق

# Surah_AtTahrim
source: At-Tahrim
ar: التحريم

# Surah_AlMulk
source: Al-Mulk
ar: الملك

# Surah_AlQalam
source: Al-Qalam
ar: القلم

# Surah_AlHaqqah
source: Al-Haqqah
ar: الحاقة

# Surah_AlMaarij
source: Al-Ma'arij
ar: المعارج

# Surah_Nuh
source: Nuh
ar: نوح

# Surah_AlJinn
source: Al-Jinn
ar: الجن

# Surah_AlMuzzammil
source: Al-Muzzammil
ar: المزمل

# Surah_AlMuddaththir
source: Al-Muddaththir
ar: المدثر

# Surah_AlQiyamah
source: Al-Qiyamah
ar: القيامة

# Surah_AlInsan
source: Al-Insan
ar: الإنسان

# Surah_AlMursalat
source: Al-Mursalat
ar: المرسلات

# Surah_AnNaba
source: An-Naba
ar: النبأ

# Surah_AnNaziat
source: An-Nazi'at
ar: النازعات

# Surah_Abasa
source: 'Abasa
ar: عبس

# Surah_AtTakwir
source: At-Takwir
ar: التكوير

# Surah_AlInfitar
source: Al-Infitar
ar: الإنفطار

# Surah_AlMutaffifin
source: Al-Mutaffifin
ar: المطففين

# Surah_AlInshiqaq
source: Al-Inshiqaq
ar: الإنشقاق

# Surah_AlBuruj
source: Al-Buruj
ar: البروج

# Surah_AtTariq
source: At-Tariq
ar: الطارق

# Surah_AlAla
source: Al-A'la
ar: الأعلى

# Surah_AlGhashiyah
source: Al-Ghashiyah
ar: الغاشية

# Surah_AlFajr
source: Al-Fajr
ar: الفجر

# Surah_AlBalad
source: Al-Balad
ar: البلد

# Surah_AshShams
source: Ash-Shams
ar: الشمس

# Surah_AlLail
source: Al-Lail
ar: الليل

# Surah_AdDuha
source: Ad-Duha
ar: الضحى

# Surah_AshSharh
source: Ash-Sharh
ar: الشرح

# Surah_AtTin
source: At-Tin
ar: التين

# Surah_AlAlaq
source: Al-'Alaq
ar: العلق

# Surah_AlQadr
source: Al-Qadr
ar: القدر

# Surah_AlBayyinah
source: Al-Bayyina
ar: البينة

# Surah_AzZalzalah
source: Az-Zalzalah
ar: الزلزلة

# Surah_AlAdiyat
source: Al-'Adiyat
ar: العاديات

# Surah_AlQariah
source: Al-Qari'a
ar: القارعة

# Surah_AtTakathur
source: At-Takathur
ar: التكاثر

# Surah_AlAsr
source: Al-'Asr
ar: العصر

# Surah_AlHumazah
source: Al-Humazah
ar: الهمزة

# Surah_AlFil
source: Al-Fil
ar: الفيل

# Surah_Quraish
source: Quraish
ar: قريش

# Surah_AlMaun
source: Al-Ma'un
ar: الماعون

# Surah_AlKawthar
source: Al-Kawthar
ar: الكوثر

# Surah_AlKafirun
source: Al-Kafirun
ar: الكافرون

# Surah_AnNasr
source: An-Nasr
ar: النصر

# Surah_AlMasad
source: Al-Masad
ar: المسد

# Surah_AlIkhlas
source: Al-Ikhlas
ar: الإخلاص

# Surah_AlFalaq
source: Al-Falaq
ar: الفلق

# Surah_AnNas
source: An-Nas
ar: الناس

source: of
ar: من

# TotalRecords
source: records
ar: السجلات

source: Next
ar: التالي

source: Previous
ar: السابق

source: Attendance Rate
ar: نسبة الحضور

source: Attendance Summary
ar: ملخص الحضور

source: Memorization Progress
ar: تقدم الحفظ

source: Juz
ar: جزء

source: Juz memorized
ar: جزء محفوظ

source: Juz remaining
ar: جزء متبقي

# WriteNote
source: Write a Note
ar: اكتب ملاحظة

# NoteContentPlaceholder
source: Write your note here...
ar: اكتب ملاحظتك هنا...

source: Send Note
ar: إرسال الملاحظة

# ConfirmDeleteNote
source: Are you sure you want to delete this note?
ar: هل أنت متأكد من حذف هذه الملاحظة؟

source: Delete Note
ar: حذف الملاحظة

# NoParentNotesHint
source: You can add notes for the teacher about your child's progress
ar: يمكنك إضافة ملاحظات للمعلم حول تقدم ابنك

source: Not provided
ar: غير متوفر
