Repository: abdulazeez761/Quranic_School
Catalog: Resources/Views/Home/Index.*.resx
Languages: ar

# Welcome
source: Welcome to Hafiz Academy
ar: مرحبًا بكم في منصة حافظ

# Heart
source: The journey of true transformation begins with divine guidance.
ar: من التربية الربانية يبدأ البناء الحقيقي

# PlatForm
source: A comprehensive platform connecting students, parents, and teachers in the beautiful journey of Quran memorization and understanding.
ar: منصة شاملة تربط الطلاب وأولياء الأمور والمعلمين في رحلة جميلة لحفظ القرآن الكريم وفهمه.

# Track
source: Track Progress
ar: تتبع التقدم المحرز

# Monitor
source: Monitor memorization & review
ar: مراقبة الحفظ والمراجعة

# Feature
source: Platform Features
ar: ميزات المنصة

# TrackDescription
source: Monitor daily wird completion, pages memorized, and review schedules with detailed analytics.
ar: راقب إنجاز الورد اليومي والصفحات المحفوظة ومراجعة الجداول الزمنية مع تحليلات مفصلة.

# Portal
source: Parent Portal
ar: بوابة الوالدين

# PortalDescription
source: Parents can view their child's progress, upcoming assignments.
ar: يمكن لأولياء الأمور الاطلاع على تقدم ابنائهم والواجبات القادمة.

# Wird
source: Wird Management
ar: ادارة الورد

# WirdDescription
source: Organize memorization tasks by Juz, pages, or verses with automated scheduling.
ar: نظِّم مهام الحفظ حسب الأجزاء أو الصفحات أو الآيات واضافة تقييمات.

# Dashboard
source: Teacher Dashboard
ar: لوحة تحكم للمدرس

# DashboardDescription
source: Comprehensive tools for teachers to assign tasks, track student progress, and provide feedback.
ar: أدوات شاملة للمعلمين لتعيين المهام وتتبع تقدم الطلاب وتقديم الملاحظات.

# Review
source: Review System
ar: نظام المراجعة

# ReviewDescription
source: Smart review scheduling to ensure previously memorized content is regularly practiced.
ar: جدولة المراجعة الذكية لضمان ممارسة المحتوى المحفوظ مسبقًا بانتظام.

# Mobile
source: Mobile Friendly
ar: يدعم الجوال

# MobileDescription
source: Access your learning platform anywhere, anytime with our responsive design.
ar: تمتع بالوصول إلى منصة التعلُّم الخاصة بك في أي مكان وفي أي وقت مع تصميمنا سريع الاستجابة.

# Mission
source: Our Mission
ar: مهمتنا

# MissionDescription
source: To provide a modern, efficient platform that strengthens the bond between students, parents, and teachers in the sacred journey of Quran memorization.
ar: توفير منصة عصرية وفعّالة تقوّي الروابط بين الطلاب وأولياء الأمور والمعلمين في رحلة تحفيظ القرآن الكريم.

# missionPoint-1
source: Structured learning paths for every studen
ar: مسارات تعليمية منظمة لكل طالب

# missionPoint-2
source: Real-time progress monitoring and reporting
ar: مراقبة التقدم المحرز في الوقت الحقيقي وإعداد التقارير

# missionPoint-3
source: Strong parent-teacher-student communication
ar: تواصل قوي بين الوالدين والمعلم والطالب

# missionPoint-4
source: Personalized wird and review schedules
ar: الجداول الزمنية المخصصة والمراجعة

# Students
source: Active Students
ar: عدد الطلاب

# QTeachers
source: Qualified Teachers
ar: المعلمون المؤهلون

source: Pages Memorized
ar: الصفحات المحفوظة

# Hifz
source: Completed Hifz
ar: عدد الحفاظ

# Vision
source: Our Vision
ar: رؤيتنا

# VisionDescription
source: To become the leading digital platform for Quran education, empowering students worldwide to connect with the divine words of Allah through innovative technology and traditional Islamic teaching methods.
ar: تمكين الطلاب في جميع أنحاء العالم من التواصل مع كلام الله تعالى من خلال التكنولوجيا المبتكرة وأساليب التعليم الإسلامي التقليدية.

# Stories
source: Student Success Stories
ar: قصص نجاح الطلاب

# StoriesDescription
source: Hear from our students and their journey
ar: استمع الى قصص نجاح الطلاب من الطلاب انفسهم

# Achievements
source: Our Achievements
ar: انجازاتنا

# AchievementsHeader
source: Milestones in our journey of excellence
ar: معالم بارزة في رحلتنا للتميز

source: Excellence Award
ar: جائزة التميز

source: Best Quran Academy 2024
ar: أفضل أكاديمية قرآنية 2024

source: Digital Innovation
ar: الابتكار الرقمي

source: Technology in Education Award
ar: جائزة التكنولوجيا في التعليم

source: Community Impact
ar: التأثير المجتمعي

source: Outstanding Service Recognition
ar: تقدير الخدمة المتميزة

source: Student Success
ar: نجاح الطلاب

source: 100% Completion Rate
ar: نسبة إتمام 100%

source: Start Learning
ar: ابدأ التعلم

source: Learn More
ar: اعرف المزيد

# TargetTitle
source: Who Is This Academy For?
ar: لمن هذه الأكاديمية؟

# TargetSubtitle
source: Specialized programs for every age group
ar: برامج متخصصة لكل فئة عمرية

# TargetChildren
source: Children aged 5-12
ar: الأطفال من 5-12 سنة

# TargetChildrenDesc
source: Quran memorization program with simple understanding of meanings and gradual faith-based education
ar: برنامج تحفيظ القرآن الكريم مع فهم بسيط للمعاني وتربية إيمانية متدرجة

# TargetGirls
source: Girls aged 10-17
ar: الفتيات من 10-17 سنة

# TargetGirlsDesc
source: Comprehensive faith education program: Prophetic biography, creed, ethics, and simplified jurisprudence
ar: برنامج التربية الإيمانية الشامل: سيرة نبوية، عقيدة، أخلاق، وفقه مبسط

# TargetParents
source: Interested Parents
ar: الأهالي المهتمين

# TargetParentsDesc
source: Parents seeking safe and effective Islamic education for their children from home
ar: أولياء أمور يبحثون عن تعليم شرعي آمن وفعّال لأبنائهم من المنزل

# FeaturesTitle
source: Dhikr Academy Features
ar: مميزات أكاديمية ذِكر

# FeaturesSubtitle
source: Why choose our platform to educate your children?
ar: لماذا تختار منصتنا لتعليم أبنائك؟

# ProgramsTitle
source: Our Educational Programs
ar: 🎓 برامجنا التعليمية

# ProgramsSubtitle
source: Diverse programs suitable for all ages and levels
ar: برامج متنوعة تناسب جميع الأعمار والمستويات

# ProgramQuran
source: Quran Memorization
ar: تحفيظ القرآن الكريم

# ProgramQuranAge
source: Children aged 5 to 12
ar: أطفال من 5 إلى 12 سنة

# ProgramQuranF1
source: Gradual and organized memorization
ar: حفظ متدرج ومنظم

# ProgramQuranF2
source: Continuous periodic review
ar: مراجعة دورية مستمرة

# ProgramQuranF3
source: Simple understanding of meanings
ar: فهم بسيط للمعاني

# ProgramQuranF4
source: Gradual faith-based education
ar: تربية إيمانية متدرجة

# ProgramFaith
source: Faith Education
ar: التربية الإيمانية

# ProgramFaithAge
source: Girls aged 10 to 17
ar: فتيات من 10 إلى 17 سنة

# ProgramFaithF1
source: Noble Prophetic Biography
ar: السيرة النبوية الشريفة

# ProgramFaithF2
source: Correct Creed
ar: العقيدة الصحيحة

# ProgramFaithF3
source: Islamic Ethics and Manners
ar: الأخلاق والآداب الإسلامية

# ProgramFaithF4
source: Simplified Jurisprudence
ar: الفقه المبسط

# ProgramFollowup
source: Reinforcement and Follow-up
ar: التثبيت والمتابعة

# ProgramFollowupAge
source: All ages
ar: لكل الأعمار

# ProgramFollowupF1
source: Comprehensive periodic review
ar: مراجعة دورية شاملة

# ProgramFollowupF2
source: Motivating rewards system
ar: نظام جوائز محفز

# ProgramFollowupF3
source: Diligent and continuous follow-up
ar: متابعة حثيثة ومستمرة

# ProgramFollowupF4
source: Continuous achievement assessment
ar: تقييم مستمر للإنجاز

# WhyChooseTitle
source: Why Choose "Dhikr"?
ar: 💡 لماذا تختار "ذِكر"؟

# WhyChooseSubtitle
source: A unique and distinguished educational experience
ar: تجربة تعليمية فريدة ومتميزة

# WhyItem1Title
source: Comfortable and safe learning from home
ar: 🟢 تجربة تعليمية مريحة وآمنة من المنزل

# WhyItem1Desc
source: A safe and comfortable learning environment that ensures the comfort of the student and family
ar: بيئة تعليمية آمنة ومريحة تضمن راحة الطالب والأهل

# WhyItem2Title
source: Fun approach combining seriousness and educational activities
ar: 🟢 أسلوب ممتع يجمع بين الجدية والأنشطة التربوية

# WhyItem2Desc
source: A balanced methodology that achieves educational goals in an engaging way
ar: منهجية متوازنة تحقق الأهداف التعليمية بطريقة محببة

# WhyItem3Title
source: Precise follow-up for each student through a dedicated page
ar: 🟢 متابعة دقيقة لكل طالب من خلال صفحة خاصة

# WhyItem3Desc
source: An advanced system for tracking each student's progress individually and in detail
ar: نظام متطور لمتابعة تقدم كل طالب بشكل فردي ومفصل

# WhyItem4Title
source: Instant notifications for every assignment or evaluation
ar: 🟢 إشعارات فورية لكل واجب أو تقييم

# WhyItem4Desc
source: Real-time alerts that keep parents constantly informed of their children's progress
ar: تنبيهات لحظية تبقي الأهل على اطلاع دائم بتقدم أبنائهم

# WhyItem5Title
source: Certified teachers in digital and Islamic education
ar: 🟢 معلمون معتمدون في التعليم الرقمي والشرعي

# WhyItem5Desc
source: Qualified teaching staff specialized in working with children and e-learning
ar: كادر تعليمي مؤهل ومتخصص في التعامل مع الأطفال والتعليم الإلكتروني

# RegistrationTitle
source: Get a Free Introductory Session!
ar: 🎁 احصل على جلسة تعريفية مجانية!

# RegistrationSubtitle
source: Want to try the first session free for your child? Fill out the form now and we'll contact you within 24 hours
ar: هل تريد تجربة أول حصة مجانًا لطفلك؟ املئ النموذج الآن وسنتواصل معك خلال 24 ساعة

source: Full Name
ar: 📍 الاسم الكامل

# ChildAge
source: Child's Age
ar: 📍 عمر الطفل

source: Select age
ar: اختر العمر

source: 5 years
ar: 5 سنوات

source: 6 years
ar: 6 سنوات

source: 7 years
ar: 7 سنوات

source: 8 years
ar: 8 سنوات

source: 9 years
ar: 9 سنوات

source: 10 years
ar: 10 سنوات

source: 11 years
ar: 11 سنة

source: 12 years
ar: 12 سنة

source: 13 years
ar: 13 سنة

source: 14 years
ar: 14 سنة

source: 15 years
ar: 15 سنة

source: 16 years
ar: 16 سنة

source: 17 years
ar: 17 سنة

source: Country
ar: 📍 الدولة

# WhatsApp
source: Contact Number (WhatsApp)
ar: 📍 رقم التواصل (واتساب)

source: Notes
ar: 📍 ملاحظات

# NotesPlaceholder
source: Any notes or special requirements...
ar: أي ملاحظات أو متطلبات خاصة...

source: Submit Request
ar: إرسال الطلب

# CTATitle
source: Dhikr is not just a memorization platform
ar: 💚 ذِكْر ليست مجرد منصة تحفيظ

# CTASubtitle
source: It's an educational companion that raises your children on the Quran and instills the love of religion in them
ar: بل رفيق تربوي ينشئ أبناءك على القرآن ويحبّب إليهم الدين

source: Register Now
ar: ✅ سجل الآن

source: Contact Us
ar: تواصل معنا
