Repository: abdulazeez761/Quranic_School
Catalog: src/Hafiz.Web/Resources/Areas/Admin/Views/Classes/Edit.*.resx
Languages: ar

# Title
source: Edit Class Information
ar: تعديل بيانات الحلقة القرآنية

# PageTitle
source: Edit Class Information
ar: تعديل بيانات الحلقة

# PageDescription
source: Update class information in the system
ar: تحديث معلومات الحلقة في النظام

source: Back to List
ar: العودة للقائمة

# ValidationError
source: Please correct the following errors:
ar: يرجى تصحيح الأخطاء التالية:

source: Basic Information
ar: المعلومات الأساسية

source: Class Name
ar: اسم الحلقة

# ClassNamePlaceholder
source: Example: Fajr Class
ar: مثال: حلقة الفجر

# Gender
source: Category
ar: الفئة

# SelectGender
source: -- Select Class Category --
ar: -- اختر فئة الحلقة --

source: Male
ar: ذكور

source: Female
ar: إناث

source: Class Time
ar: وقت الحلقة

# ClassTimeHelper
source: Select the appropriate time for the class to start
ar: حدد الوقت المناسب لبدء الحلقة

source: Class Days
ar: أيام الحلقة

source: Select Days
ar: اختر الأيام

# SelectDaysHelper
source: Select the days when the class is held during the week
ar: حدد الأيام التي تعقد فيها الحلقة خلال الأسبوع

source: Teachers and Students
ar: الشيوخ والطلاب

source: Assistant Teachers
ar: الشيوخ المساعدين

# SelectTeachersPlaceholder
source: Select teachers...
ar: اختر الشيوخ...

# TeachersHelper
source: You can select multiple teachers for the class
ar: يمكنك تحديد أكثر من شيخ للحلقة

source: Students
ar: الطلاب

# SelectStudentsPlaceholder
source: Select students...
ar: اختر الطلاب...

# StudentsHelper
source: You can select multiple students for the class
ar: يمكنك تحديد أكثر من طالب للحلقة

source: Save Changes
ar: حفظ التعديلات

source: Cancel
ar: إلغاء

source: Edit Guidelines
ar: إرشادات التعديل

# Guideline1
source: All fields marked with
ar: جميع الحقول المميزة بعلامة

# Guideline1Suffix
source: are required
ar: إلزامية

# Guideline2
source: You can edit any class information
ar: يمكنك تعديل أي معلومة من معلومات الحلقة

# Guideline3
source: Make sure to save changes by clicking "Save Changes" button
ar: تأكد من حفظ التعديلات بالضغط على زر "حفظ التعديلات"

# Guideline4
source: You can cancel changes and return to the list at any time
ar: يمكنك إلغاء التعديلات والعودة للقائمة في أي وقت

# Guideline5
source: Changes will appear immediately to all students and teachers associated with the class
ar: التعديلات ستظهر فوراً على جميع الطلاب والشيوخ المرتبطين بالحلقة

# NoResults
source: No results found
ar: لا توجد نتائج
